nc: 1
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [36, 75, 76, 55, 72, 114]  # P3/8
  - [12, 16, 19, 36, 40, 28]  # P4/16

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, Conv, [16, 3, 2, None, 1, nn.LeakyReLU(0.1)]],  # 0-P1/2  

   [-1, 1, Conv, [32, 3, 2, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, SE, [32, 2]],

   [-1, 1, Conv, [16, 3, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, SE, [16, 2]],
   
   [-1, 1, Conv, [16, 3, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, SE, [16, 2]],
  
   [[-1, -3], 1, Concat, [1]],

   [-1, 1, Conv, [32, 3, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, SE, [32, 2]],

   [[-8, -1], 1, Concat, [1]],

   [-1, 1, SE, [64, 2]],

   [-1, 1, MP, []] # 12
  ]

# yolov7-tiny head
head:
  [[-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, Conv, [128, 3, 2, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, SE, [128, 2]],

   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, SE, [256, 2]],

   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]], # First scale

   [-2, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],

   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [[-1, -10], 1, Concat, [1]],

   [-1, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, SE, [128, 2]],

   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, SE, [128, 2]],

   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],

   [[-1,-10], 1, Detect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
